Repository: UKhurshed/search_github_repos
Catalog: lib/core/l10n/app_*.arb
Languages: ru

# serverFailure
source: Server-side operation failed
ru: Произошел сбой работы на стороне сервера

# cacheFailure
source: An error occurred with the operation of the database
ru: Произошла ошибка с работы базой данных

# cancelFailure
source: The request to the API server was canceled
ru: Запрос к серверу API был отменен

# connectTimeOutFailure
source: Connection timeout with the API server
ru: Тайм-аут соединения с сервером API

# dioOtherFailure
source: There was a failure when connecting to the Internet
ru: При подключения к интернету произошел сбой

# receiveTimeOutFailure
source: Receiving timeout in connection with the API server
ru: Тайм-аут получения в связи с сервером API

# sendTimeOutFailure
source: Sending timeout in connection with the API server
ru: Тайм-аут отправки в связи с сервером API

# badRequestFailure
source: The URL request was incorrectly assembled
ru: URL-запрос неправильно собран

# notFoundFailure
source: Resource not found
ru: Ресурс не найден

# somethingWentWrongFailure
source: An error has occurred, try again!
ru: Произошла ошибка, попробуйте снова!

source: Internal server error
ru: Внутренняя ошибка сервера

# textFieldHint
source: Search repository
ru: Поиск репозиторий

source: Oups, error!
ru: Упс, ошибка!

source: Close
ru: Закрыть

source: Search
ru: Поиск

# requiredThreeCharacters
source: Enter at least three characters
ru: Введите не менее трех символов

source: No description
ru: Нет описания

source: SortBy
ru: Сортировать по
